---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleSlotLength
source: html/7bc0b2c7-61d6-24ef-165a-ee913452a5ec.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleSlotLength Property

"Length of the slot"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleSlotLength { get; }
```